app/Controllers/AjaxController.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'kembali'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT *
FROM `anggota`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function dashboard_admin()
    {
        $bukuModel = new \App\Models\BukuModel();
        $peminjamanModel = new \App\Models\PeminjamanModel();
        $anggotaModel = new \App\Models\AnggotaModel();
        $artikelModel = new \App\Models\ArtikelModel();

        $total_buku = $bukuModel->countAllResults();
        $total_peminjaman = $peminjamanModel->where('status', 'dipinjam')->countAllResults();
        $total_dikembalikan = $peminjamanModel->where('status', 'kembali')->countAllResults();
        $total_transaksi = $peminjamanModel->countAllResults(); // Semua transaksi (dipinjam + kembali)
        $total_anggota = $anggotaModel->distinct()->countAllResults('email');
        $total_artikel = $artikelModel->countAllResults();