app/Controllers/Anggota.php

SELECT *
FROM `anggota`
WHERE `email` = 'admin@email.com'
 LIMIT 1
---
    public function postLogin()
    {
        helper(['form']);

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (empty($email) || empty($password)) {
            session()->setFlashdata("flash_msg", "Email dan Password wajib diisi.");
            return redirect()->to('/anggota/login')->withInput();
        }

        $session = session();
        $model = new AnggotaModel();

        $anggota = $model->where('email', $email)->first();