app/Controllers/Home.php

SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
ORDER BY `buku`.`id_buku` DESC
SELECT *
FROM `kategori`
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT COUNT(*) AS `numrows` FROM `artikel`
---
    public function index()
    {
        $bukuModel = new BukuModel();
        // Ambil data buku beserta nama kategori
        $buku = $bukuModel
            ->select('buku.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->orderBy('buku.id_buku', 'DESC')
            ->findAll();

        // Ambil semua kategori untuk sidebar/layout
        $kategoriModel = new KategoriModel();
        $kategori = $kategoriModel->findAll();

        // Pastikan akses database dengan benar
        $db = \Config\Database::connect();
        $total_buku = $db->table('buku')->countAll();
        $total_anggota = $db->table('anggota')->countAll();
        $total_artikel = $db->table('artikel')->countAll();