app/Controllers/PeminjamanAjaxController.php

SELECT *
FROM `peminjaman`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
---
    public function kelola_peminjaman()
    {
        $title = 'Daftar Peminjaman (Admin)';
        $model = new PeminjamanModel();

        // Optional: pencarian berdasarkan judul_buku atau status
        $q = $this->request->getVar('q') ?? '';
        $status = $this->request->getVar('status') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        // Query builder untuk tabel peminjaman
        $builder = $model->select('*');

        if (!empty($q)) {
            $builder->groupStart()
                ->like('judul_buku', $q)
                ->orLike('id_anggota', $q)
                ->orLike('id_buku', $q)
                ->groupEnd();
        }

        if (!empty($status)) {
            $builder->where('status', $status);
        }

        $perPage = 10;
        $data = [
            'title' => $title,
            'q' => $q,
            'status' => $status,
            'peminjaman' => $builder->orderBy('id', 'DESC')->paginate($perPage, 'default', $page),

SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '38'
DELETE FROM `peminjaman`
WHERE `id` IN ('38')
---
    public function hapus($id = null)
    {
        $model = new PeminjamanModel();

        if (!$id || !$model->find($id)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Data tidak ditemukan'
            ])->setStatusCode(404);
        }

        if (!$model->delete($id)) {